PythonFOAM/TurbulenceModel_Examples/PysimpleFoam/YamashinaClosedPython/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    in
    {
        type            patch;
        nFaces          378;
        startFace       1180106;
    }
    out
    {
        type            patch;
        nFaces          976;
        startFace       1180484;
    }
    si
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          46926;
        startFace       1181460;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          72887;
        startFace       1228386;
    }
)

// ************************************************************************* //
