PythonFOAM/TurbulenceModel_Examples/PysimpleFoam/YamashinaClosedPython/0/U

/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
in
{
        type            fixedValue; 
        value           uniform (0.01270 -0.01270 0.0000);
}
out
{
       type            zeroGradient;
}
walls
{
        type            fixedValue; 
        value           uniform (0. 0. 0.);
}
si
{
        type            symmetry;
}
}
