PythonFOAM/TurbulenceModel_Examples/PysimpleFoam/YamashinaClosedPython/0/nut

/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
in
{
 type            calculated;
        value           uniform 0;
}
out
{
        type            calculated;
        value           uniform 0;
}
walls
{
        type            nutkWallFunction;
        value           uniform 0;
}
si
{
        type            symmetry;
}
}
